# Работа с SQLite

- https://sqliteonline.com/

In [120]:
import sqlite3
from prettytable import from_db_cursor

In [121]:
import os 

# временный каталог
TEMP_DIR = "temp"

# создать подкаталог, если его нет
if not os.path.exists(TEMP_DIR):
    os.mkdir(TEMP_DIR)

# пример
os.path.join(TEMP_DIR, "temp_SQLite.db")

'temp\\temp_SQLite.db'

In [122]:
#db_name = os.path.join(TEMP_DIR, "temp_SQLite.db")
db_name = ":memory:"

In [123]:
db = sqlite3.connect(db_name)
cur = db.cursor()

In [124]:
#cur.execute("CREATE TABLE cities (name)")
#cur.execute("CREATE TABLE cities (name varchar(100))")
cur.execute("CREATE TABLE cities (id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, name VARCHAR(100) UNIQUE)")
db.commit()

In [125]:
cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+------+
| id | name |
+----+------+
+----+------+

In [126]:
cur.execute("PRAGMA table_info('cities')")
from_db_cursor(cur)

+-----+------+--------------+---------+------------+----+
| cid | name |     type     | notnull | dflt_value | pk |
+-----+------+--------------+---------+------------+----+
|  0  |  id  |   INTEGER    |    1    |    None    | 1  |
|  1  | name | VARCHAR(100) |    0    |    None    | 0  |
+-----+------+--------------+---------+------------+----+

In [127]:
cur.execute("PRAGMA table_info('cities')")
t = from_db_cursor(cur)
print(t)

+-----+------+--------------+---------+------------+----+
| cid | name |     type     | notnull | dflt_value | pk |
+-----+------+--------------+---------+------------+----+
|  0  |  id  |   INTEGER    |    1    |    None    | 1  |
|  1  | name | VARCHAR(100) |    0    |    None    | 0  |
+-----+------+--------------+---------+------------+----+

In [128]:
#cities = ["", "", ...]
cities = "Москва, Тверь, Бобруйск, Севастополь, Воронеж".split(', ')
cities

['Москва', 'Тверь', 'Бобруйск', 'Севастополь', 'Воронеж']

In [129]:
cities_data = [(i,) for i in cities]
cities_data

[('Москва',), ('Тверь',), ('Бобруйск',), ('Севастополь',), ('Воронеж',)]

In [130]:
cur.executemany("INSERT INTO cities(name) VALUES(?)", [(i,) for i in cities])

In [131]:
cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+-------------+
| id |     name    |
+----+-------------+
| 1  |    Москва   |
| 2  |    Тверь    |
| 3  |   Бобруйск  |
| 4  | Севастополь |
| 5  |   Воронеж   |
+----+-------------+

In [132]:
for line  in cur.execute("SELECT * FROM cities"):
    print(line)

(1, 'Москва')
(2, 'Тверь')
(3, 'Бобруйск')
(4, 'Севастополь')
(5, 'Воронеж')

In [133]:
cur.execute("SELECT * FROM cities ORDER BY name DESC")

In [134]:
sql = "INSERT INTO cities(name) VALUES (?)"
cur.execute(sql, ("London",))
cur.execute(sql, ("Berlin",))
db.commit()
#
cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+-------------+
| id |     name    |
+----+-------------+
| 1  |    Москва   |
| 2  |    Тверь    |
| 3  |   Бобруйск  |
| 4  | Севастополь |
| 5  |   Воронеж   |
| 6  |    London   |
| 7  |    Berlin   |
+----+-------------+

In [135]:
sql = "DELETE FROM cities WHERE id = 7"
cur.execute(sql)
db.commit()
#
cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+-------------+
| id |     name    |
+----+-------------+
| 1  |    Москва   |
| 2  |    Тверь    |
| 3  |   Бобруйск  |
| 4  | Севастополь |
| 5  |   Воронеж   |
| 6  |    London   |
+----+-------------+

In [136]:
sql = """
UPDATE cities
SET name = 'г. ' || name
WHERE id = 1
and name not LIKE 'г. %'
"""
cur.execute(sql)
db.commit()
cur.execute("SELECT * FROM cities")
from_db_cursor(cur)

+----+-------------+
| id |     name    |
+----+-------------+
| 1  |  г. Москва  |
| 2  |    Тверь    |
| 3  |   Бобруйск  |
| 4  | Севастополь |
| 5  |   Воронеж   |
| 6  |    London   |
+----+-------------+